---
kind: other
id: Methods.T:Autodesk.Revit.DB.DirectContext3D.VertexStreamPositionColored
source: html/3cfb6163-b019-9797-7c10-f3f15af26e07.htm
---
# VertexStreamPositionColored Methods

Inserts a VertexStreamPositionColored into the stream and associated buffer.